
"""
Реалізуйте алгоритм сортування вибором.
"""

N = 10000    # Кількість елементів масиву.
             # Використовується у головній програмі для генерування масиву з випадкових чисел
             # Для повільних алгоритмів сортування з асимптотикою n**2 рекомендується
             # використовувати значення не більше 10к
             # Для швидких алгоритмів сортування з асимптотикою
             # nlog(n) встановіть значення 1 000 000


def sort(array):
    """ Сортування масиву
    :param array: Вхідний масив даних, що треба відсортувати.
    """
    n = len(array)
    for i in range(n - 1, 0, -1):
        max_index = 0
        for j in range(1, i + 1):
            if array[max_index] < array[j]:
                max_index = j
        array[j], array[max_index] = array[max_index], array[j]

